public/autobiography/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt;
</p>

<div id="outline-container-orgd082f86" class="outline-2">
<h2 id="orgd082f86">About Me</h2>
<div class="outline-text-2" id="text-orgd082f86">
<p>
Hi, I am Giovanni.
I was born in the city of Senigallia in the east coast of Italy. Later
my family was joined by two younger brothers and one sister.
</p>
</div>

<div id="outline-container-org0a1e382" class="outline-3">
<h3 id="org0a1e382">Early life</h3>
<div class="outline-text-3" id="text-org0a1e382">
<p>
I don't have many memories of my early childhood. When I was about 10
(I think) I began playing minecraft 1.5.2 and watching youtube videos
about the game, the oldest videos I recall are the ones of
"<a href="https://www.youtube.com/@ELeternaL/videos">EternalLove</a>". My first world was in creative mode, I was in an island
and I was slowly learning what blocks were available and how they
worked in the game. I later started a <a href="https://youtu.be/bq1IvqHm1hM?si=0_RwR9lEFWRqlvIi">survival world</a> which I would
continue for many years, my base was in a swamp biome.
</p>

<p>
After a family trip in northern Italy I remember I was curious about
"how do people make computer programs", so I asked my dad, which is
not an expert, but he hinted that they were made with programming
languages "like C++". When I came back home I started looking what was
this "c++".  I downloaded dev-c++ and began writing classic programs
like text based games with decision trees. I <a href="old-programs-cpp.html">still have many of those</a>.
</p>

<p>
When I was about 13 I began watching youtube videos on <a href="https://youtu.be/6AZmhj82W-8?si=AkQrqeGK4nUhTl6F">how to make
videogames with Unity</a> engine and I made my own little horror
games. I remember spending most of my wake time watching these videos,
programmingin C# and playing either minecraft of The Sims 1.
</p>

<p>
During the same time I wanted to make youtube videos myself so I
started a <a href="https://www.youtube.com/@San7oS">gaming channel</a> where I would play minecraft and other
games. This was a crazy yourney: I learned so many thing like advanced
redstone, video editing and recording, creating miniatures with
photoshop and so many other things. I was really invested in my
minecraft world and I remember this period as an happy one because I
had always so many redstone projects in mind and I was working on
something that made me proud. However, even good things come to an end
and by 2019 my perfectionism was making me anxious and depressed
because everything had to be perfect and I could not allow myself any
errors. I decided to quit the channel out of frustration and play
other games like Dark Souls 1 and Skyrim.
</p>
</div>
</div>

<div id="outline-container-org8ac6bbe" class="outline-3">
<h3 id="org8ac6bbe">High School</h3>
<div class="outline-text-3" id="text-org8ac6bbe">
<p>
I attended the Liceo Scientifico "Enrico Medi" where I participated in
programming Olympiads and cybersecurity competitions. I was doing good
in the competitions, reaching nationals every time and this made me
choose the path ahead: I wanted to be a <a href="../programming/programming.html">computer scientist</a>.  In
particular, I participated in the cyberchallenge which is an
university CTF competition and I arrived first place and competed in
the nationals. During this time, I met probably the greatest
programmer I know, Leonardo Taccari, which is part of the board of
NetBSD and a true UNIX fellow. I asked him suggestions about books to
learn UNIX and he suggested me "Advanced Programming in the Unix
Environment", a book that I bought and read all the way in the
following months. Later this book would influence me to dig deeper in
operating systems and UNIX kernels and stay close to the operating
systems world.
</p>

<p>
Yet, I was a very shy and introverted person, and I lacked any type of
social skills. I was very isolated and I would never leave my room
other than for going to school just to feel even more isolated. This
was really hard mentally, I needed to do something to help my mental
sanity. On my last year of high school I began pushing myself out of
my comfort zone and participating in some activities like <a href="../ephemeris/2025-05-14.html">theater</a>
courses. This was the bravest decision of my life and It would change
the course of it. Slowly, I started getting used to going outside of
my room and being surrounded by other people, something I was greatly
struggling (and still do sometimes). I also met F which helped me a
lot with my self confidence and isolation.
</p>

<p>
The last year of high school was different from the others. I found
some people to talk to, I did creative writing, public speaking and
theater. I also travelled by myself for the fist time: I went to
<a href="../stash/photography/sicily.html">Sicily</a> several times, I still remember those days vividly, then to
Florence for a performance and to Turin for the national final of the
cybersecurity olimpiads. I graduated with top marks and I started
writing my diary.
</p>
</div>
</div>

<div id="outline-container-org2c28dfb" class="outline-3">
<h3 id="org2c28dfb">University</h3>
<div class="outline-text-3" id="text-org2c28dfb">
<p>
I continued my studies in Computer Science in Trento, in the Italian
Alps.
</p>

<p>
The first year I was feeling a lot of pressure and anxiety, yet I
managed to be stoic about It and kept pushing through. At the end of
January 2023 I travelled across Europe alone with <a href="../stash/photography/interrail.html">interrail</a>, this was
meant as a voyage of self discovery and I wrote hundreds of pages of my
diary. It was a period where I felt stuck and I was uncertain about my
future. In the second half of the year I began volunteering in a
local hiking association. I was organizing hikes for groups of kids, I
felt a lot of responsibility but I also had a lot of fun. I learned a
lot. In the summer I went one week in the mountains and I joined a
folk dances group.
</p>

<p>
In my second year at university was a difficult year, by the end of it
I went through a big breakdown that would follow me for another
year. I decided to focus fully on studying computer science, which is
what I have always liked. I began intermediate projects like a <a href="https://github.com/San7o/Brenta-Engine">game
engine</a> and a <a href="https://github.com/San7o/Baldo-Scanner">vulnerability scanner</a> and I got into Linux kernel
development and cloud computing.
</p>

<p>
To be continued&#x2026;
</p>

<hr />

<p>
Travel: <a href="../index.html">Giovanni's Diary</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
